[
  {
    "Id": 0,
    "Name": "American",
    "Recipes": [
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Mac and Cheese",
        "CoverImage": {
          "Url": "mac-and-cheese.webp",
          "AltText": "A bowl of creamy mac and cheese topped with bread crumbs and parsley"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "Indulge in the ultimate comfort food with this creamy and cheesy mac and cheese recipe. Perfect for a cozy night in or as a side dish for gatherings.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "8 oz elbow macaroni",
          "3 cups shredded cheddar cheese",
          "2 cups milk",
          "1/4 cup butter",
          "1/4 cup all-purpose flour",
          "1/2 cup bread crumbs",
          "Salt and pepper to taste",
          "Optional: chopped parsley for garnish"
        ],
        "Instructions": {
          "Markdown": "1. Cook the elbow macaroni according to the package instructions. Drain and set aside.\n2. In a separate pot, melt the butter over medium heat. Once melted, add the flour and whisk continuously for 2-3 minutes to make a roux.\n3. Gradually pour in the milk, whisking constantly to avoid lumps. Continue cooking and stirring until the mixture thickens to a creamy consistency.\n4. Reduce the heat to low, then stir in 2 1/2 cups of shredded cheddar cheese until melted and the sauce is smooth.\n5. Add the cooked macaroni to the cheese sauce and stir until well combined. Season with salt and pepper to taste.\n6. Transfer the mac and cheese mixture to a baking dish. Sprinkle the remaining 1/2 cup of shredded cheddar cheese on top, followed by a layer of bread crumbs.\n7. Bake in a preheated oven at 350°F (175°C) for 20-25 minutes, or until the cheese is bubbly and the bread crumbs are golden brown.\n8. Garnish with chopped parsley if desired and serve hot. Enjoy your creamy and indulgent mac and cheese!",
          "Html": null
        }
      },
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "BBQ Ribs",
        "CoverImage": {
          "Url": "bbq-ribs.webp",
          "AltText": "BBQ Ribs plated on a wooden board with a side of coleslaw and corn on the cob"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "Delicious and tender BBQ ribs with a smoky and tangy flavor that will satisfy your cravings for a hearty and flavorful meal.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "2 racks of pork baby back ribs",
          "1 cup of BBQ sauce",
          "1/4 cup of brown sugar",
          "1 tablespoon of paprika",
          "1 teaspoon of garlic powder",
          "1 teaspoon of onion powder",
          "1 teaspoon of black pepper",
          "1/2 teaspoon of salt"
        ],
        "Instructions": {
          "Markdown": "1. Preheat your oven to 275°F (135°C). \n2. Remove the membrane from the back of the ribs and trim any excess fat. \n3. In a small bowl, mix together the brown sugar, paprika, garlic powder, onion powder, black pepper, and salt. \n4. Rub the spice mixture all over the ribs, ensuring they are evenly coated. \n5. Place the ribs on a baking sheet, cover with aluminum foil, and bake for 2-2.5 hours, or until the meat is tender. \n6. Preheat your grill to medium-high heat. \n7. Once the ribs are done in the oven, carefully remove them and brush them with BBQ sauce. \n8. Grill the ribs for 5-10 minutes, turning and basting with more BBQ sauce occasionally, until they are nicely charred. \n9. Let the ribs rest for a few minutes before slicing and serving. Enjoy your delicious BBQ ribs!",
          "Html": null
        }
      },
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Cheeseburger",
        "CoverImage": {
          "Url": "cheeseburger.webp",
          "AltText": "A delicious cheeseburger plated on a wooden board with crispy fries and a pickle on the side"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "The classic cheeseburger recipe featuring juicy beef patty, melted cheese, fresh vegetables, and condiments, all sandwiched between soft burger buns.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "1 lb ground beef",
          "4 hamburger buns",
          "4 slices of cheese (such as cheddar or American)",
          "Lettuce leaves",
          "Sliced tomatoes",
          "Sliced onions",
          "Pickles",
          "Ketchup",
          "Mustard",
          "Salt and pepper to taste"
        ],
        "Instructions": {
          "Markdown": "1. Divide the ground beef into 4 equal portions and shape them into patties.\n2. Season the patties with salt and pepper.\n3. Preheat a grill or skillet over medium-high heat.\n4. Cook the patties for about 4-5 minutes on each side, or until desired doneness.\n5. During the last minute of cooking, place a slice of cheese on each patty to melt.\n6. Assemble the cheeseburgers by placing lettuce, tomato, and onion slices on the bottom half of each burger bun.\n7. Place the cooked cheese patties on top of the vegetables.\n8. Add pickles and drizzle ketchup and mustard on top.\n9. Top with the other half of the burger bun.\n10. Serve the cheeseburgers with your favorite side dishes and enjoy!",
          "Html": null
        }
      },
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Apple Pie",
        "CoverImage": {
          "Url": "apple-pie.webp",
          "AltText": "An image of a mouth-watering apple pie fresh out of the oven"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "A classic American dessert featuring tender, cinnamon-spiced apples baked in a flaky crust.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "6 cups thinly sliced apples",
          "3/4 cup white sugar",
          "1 tsp ground cinnamon",
          "1/4 tsp ground nutmeg",
          "1 tbsp lemon juice",
          "2 tbsp butter",
          "1 egg",
          "1 tbsp water",
          "1 double pie crust"
        ],
        "Instructions": {
          "Markdown": "1. Preheat the oven to 425°F (220°C).\n2. In a large bowl, toss the sliced apples with lemon juice.\n3. In a separate bowl, mix the sugar, cinnamon, and nutmeg, then add the mixture to the apples and toss to coat evenly.\n4. Roll out half of the pie crust and line a 9-inch pie dish with it.\n5. Pour the apple mixture into the pie crust, then dot with butter.\n6. Roll out the remaining pie crust and place it over the filling. Trim, seal, and flute the edges.\n7. Beat the egg and water together to create an egg wash, then brush it over the top crust.\n8. Cut slits in the top crust to allow steam to escape.\n9. Place the pie on a baking sheet to catch any drips, then bake for 15 minutes.\n10. Reduce the oven temperature to 350°F (175°C), and continue baking for 35 to 45 minutes, or until the apples are soft and the crust is golden brown.",
          "Html": null
        }
      },
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Fried Chicken",
        "CoverImage": {
          "Url": "fried-chicken.webp",
          "AltText": "Fried chicken on a plate with a side of coleslaw and a hot honey drizzle"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "Enjoy crispy and flavorful fried chicken with this classic recipe. Perfect for a cozy family dinner or a picnic!",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "4 chicken legs",
          "2 cups buttermilk",
          "1 cup all-purpose flour",
          "1 tsp paprika",
          "1 tsp garlic powder",
          "1 tsp onion powder",
          "1/2 tsp cayenne pepper",
          "1/2 tsp salt",
          "1/4 tsp black pepper",
          "Vegetable oil for frying"
        ],
        "Instructions": {
          "Markdown": "1. Place the chicken legs in a bowl and pour the buttermilk over them. Cover and refrigerate for at least 1 hour or overnight.\n2. In a shallow dish, mix the flour, paprika, garlic powder, onion powder, cayenne pepper, salt, and black pepper.\n3. Heat 2 inches of vegetable oil in a large skillet over medium-high heat.\n4. Remove the chicken from the buttermilk, allowing any excess to drip off. Dredge the chicken pieces in the seasoned flour, shaking off any excess.\n5. Carefully place the coated chicken in the hot oil. Fry for about 10-12 minutes per side, or until golden brown and the internal temperature reaches 165°F (75°C).\n6. Remove the chicken from the oil and place on a wire rack to drain. Serve hot and enjoy!",
          "Html": null
        }
      }
    ]
  },
  {
    "Id": 0,
    "Name": "Chinese",
    "Recipes": [
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Sweet and Sour Chicken",
        "CoverImage": {
          "Url": "sweet-and-sour-chicken.webp",
          "AltText": "Sweet and Sour Chicken plated on a white serving dish with colorful vegetables and pineapple garnish"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "A classic Chinese takeout dish featuring crispy fried chicken coated in a tangy sweet and sour sauce.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "1 lb boneless, skinless chicken thighs, cut into bite-sized pieces",
          "1/2 cup cornstarch",
          "2 eggs, beaten",
          "1 red bell pepper, cut into chunks",
          "1 green bell pepper, cut into chunks",
          "1 small onion, cut into chunks",
          "1 cup pineapple chunks",
          "1 cup sweet and sour sauce",
          "3 tablespoons soy sauce",
          "2 tablespoons rice vinegar",
          "1 tablespoon brown sugar",
          "1 teaspoon minced garlic",
          "1 teaspoon minced ginger",
          "1/4 cup vegetable oil for frying",
          "Cooked white rice, for serving",
          "Sesame seeds and chopped green onions for garnish (optional)"
        ],
        "Instructions": {
          "Markdown": "1. In a bowl, mix the sweet and sour sauce, soy sauce, rice vinegar, brown sugar, minced garlic, and minced ginger. Set aside.\n\n2. Place the cornstarch in a shallow dish and the beaten eggs in another. Coat the chicken pieces in cornstarch, then dip them in the beaten eggs.\n\n3. In a large skillet, heat the vegetable oil over medium-high heat. Fry the coated chicken pieces until they are golden and crispy. Remove and set aside on a paper towel-lined plate.\n\n4. In the same skillet, add a little more oil if needed, then sauté the bell peppers and onion until they start to soften.\n\n5. Add the pineapple chunks and the sweet and sour sauce mixture to the skillet. Stir and bring to a simmer.\n\n6. Return the crispy chicken pieces to the skillet and toss to coat with the sweet and sour sauce.\n\n7. Serve the sweet and sour chicken over cooked white rice, and garnish with sesame seeds and chopped green onions if desired.",
          "Html": null
        }
      },
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Beef and Broccoli Stir-Fry",
        "CoverImage": {
          "Url": "beef-and-broccoli-stirfry.webp",
          "AltText": "Beef and broccoli stir-fry on a white plate with chopsticks and garnished with sesame seeds"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "A delicious and easy-to-make beef and broccoli stir-fry with tender strips of beef, crisp broccoli, and a savory sauce. Perfect for a quick and flavorful weeknight meal.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "1 pound flank steak, thinly sliced",
          "1/2 cup low sodium soy sauce",
          "3 tablespoons oyster sauce",
          "2 tablespoons brown sugar",
          "2 cloves garlic, minced",
          "1 tablespoon grated fresh ginger",
          "2 tablespoons vegetable oil",
          "1 head of broccoli, cut into florets",
          "2 tablespoons cornstarch",
          "1/4 cup water",
          "Cooked white rice, for serving",
          "Optional: sesame seeds for garnish"
        ],
        "Instructions": {
          "Markdown": "1. In a bowl, mix together the soy sauce, oyster sauce, brown sugar, garlic, and ginger. Add the sliced flank steak to the marinade and let it sit for at least 15 minutes.\n2. In a large skillet or wok, heat 1 tablespoon of vegetable oil over medium-high heat. Add the marinated beef and cook until browned and cooked to your desired level of doneness. Remove the beef from the skillet and set it aside.\n3. In the same skillet, add another tablespoon of vegetable oil. Add the broccoli florets and cook for about 4-5 minutes, or until they are tender but still slightly crisp.\n4. In a small bowl, mix the cornstarch with water to create a slurry. Pour the slurry into the skillet with the broccoli and add the cooked beef back in.\n5. Pour the remaining marinade over the beef and broccoli. Cook, stirring constantly, until the sauce thickens and coats the beef and broccoli.\n6. Serve the beef and broccoli stir-fry over cooked white rice. Optional: Garnish with sesame seeds for extra flavor and presentation.",
          "Html": null
        }
      },
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Kung Pao Chicken",
        "CoverImage": {
          "Url": "kung-pao-chicken.webp",
          "AltText": "Kung Pao Chicken plated on a serving dish with chopsticks"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "A classic Chinese dish with tender chicken, crunchy peanuts, and a flavorful mix of savory and spicy sauce.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "1 lb boneless, skinless chicken thighs, cut into 1-inch pieces",
          "1 tablespoon soy sauce",
          "1 tablespoon Shaoxing wine or dry sherry",
          "1 tablespoon cornstarch",
          "3 tablespoons vegetable oil",
          "1/2 cup peanuts",
          "3-5 dried red chilies, depending on desired spice level",
          "3 cloves garlic, minced",
          "1 inch piece of ginger, minced",
          "2 green onions, chopped",
          "For the sauce: 2 tablespoons soy sauce, 1 tablespoon hoisin sauce, 1 tablespoon oyster sauce, 1 tablespoon Chinese black vinegar or rice vinegar, 1 teaspoon sugar, 1 teaspoon cornstarch, 3 tablespoons water"
        ],
        "Instructions": {
          "Markdown": "1. In a bowl, mix the chicken with 1 tablespoon soy sauce, 1 tablespoon Shaoxing wine, and 1 tablespoon cornstarch. Set aside for 10-15 minutes.\n2. In a separate small bowl, combine all the sauce ingredients and set aside.\n3. Heat 2 tablespoons of vegetable oil in a wok or large skillet over high heat. Add the peanuts and stir-fry until golden. Remove the peanuts and set aside.\n4. Add the remaining 1 tablespoon of oil to the wok. Add the dried chilies, garlic, and ginger, and stir-fry until fragrant.\n5. Add the marinated chicken to the wok and stir-fry until it is no longer pink.\n6. Pour in the sauce and stir until the chicken is well coated and the sauce has thickened.\n7. Stir in the green onions and cooked peanuts.\n8. Serve the Kung Pao Chicken hot, garnished with additional chopped green onions if desired. Enjoy with steamed rice.",
          "Html": null
        }
      },
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Egg Fried Rice",
        "CoverImage": {
          "Url": "egg-fried-rice.webp",
          "AltText": "Egg fried rice served on a plate with chopsticks, garnished with fresh chopped green onions and a sprinkle of sesame seeds"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "Egg fried rice is a quick and delicious dish that is perfect for a satisfying meal. It\u0027s made with a simple combination of ingredients and can be customized with your favorite additions like vegetables, seafood, or tofu.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "2 cups cooked rice",
          "2 eggs, beaten",
          "1/2 cup mixed vegetables (such as peas, carrots, and corn)",
          "3 tablespoons soy sauce",
          "1 tablespoon sesame oil",
          "2 green onions, chopped (for garnish)",
          "2 tablespoons vegetable oil",
          "Salt and pepper to taste"
        ],
        "Instructions": {
          "Markdown": "1. Heat 1 tablespoon of vegetable oil in a large skillet or wok over medium-high heat. Add the beaten eggs and scramble until fully cooked. Remove the eggs from the skillet and set aside.\n2. In the same skillet, add another tablespoon of vegetable oil. Add the mixed vegetables and stir-fry for 2-3 minutes until they are tender.\n3. Add the cooked rice to the skillet with the vegetables. Use a spatula to break up any clumps and stir to combine with the vegetables.\n4. Drizzle the soy sauce and sesame oil over the rice and mix well to evenly distribute the flavors. Season with salt and pepper to taste.\n5. Push the rice to one side of the skillet and add the remaining tablespoon of vegetable oil to the empty side. Pour the beaten eggs into the oil and scramble them in the skillet until they are fully cooked.\n6. Once the eggs are cooked, mix them into the rice. Continue to stir and cook for another 2-3 minutes to ensure everything is heated through.\n7. Transfer the egg fried rice to a serving dish and garnish with chopped green onions. Serve hot and enjoy!",
          "Html": null
        }
      },
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Hot and Sour Soup",
        "CoverImage": {
          "Url": "hot-and-sour-soup.webp",
          "AltText": "Hot and Sour Soup in a traditional Chinese bowl with steam rising from the soup"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "A classic Chinese soup with a perfect balance of spicy and tangy flavors.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "6 cups chicken or vegetable broth",
          "1/2 cup sliced shiitake mushrooms",
          "1/2 cup sliced bamboo shoots",
          "1/2 cup firm tofu, diced",
          "3 tablespoons soy sauce",
          "3 tablespoons rice vinegar",
          "1 tablespoon sesame oil",
          "1 teaspoon chili paste",
          "1 teaspoon sugar",
          "1/4 teaspoon white pepper",
          "2 eggs, lightly beaten",
          "3 green onions, sliced",
          "1 tablespoon cornstarch (optional)",
          "2 tablespoons water (optional)"
        ],
        "Instructions": {
          "Markdown": "1. In a large pot, bring the chicken or vegetable broth to a boil.\n2. Add the shiitake mushrooms, bamboo shoots, and tofu to the pot and let it simmer for 5 minutes.\n3. In a small bowl, mix together the soy sauce, rice vinegar, sesame oil, chili paste, sugar, and white pepper. Add this mixture to the soup and let it cook for another 2-3 minutes.\n4. Slowly drizzle the beaten eggs into the soup while stirring gently to create silken egg ribbons.\n5. If a thicker consistency is desired, mix the cornstarch with water to make a slurry and slowly add it to the soup while stirring constantly until thickened.\n6. Garnish the soup with sliced green onions before serving.",
          "Html": null
        }
      }
    ]
  },
  {
    "Id": 0,
    "Name": "Mexican",
    "Recipes": [
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Tacos",
        "CoverImage": {
          "Url": "tacos.webp",
          "AltText": "Tacos on a beautiful plate"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "Tacos are a delicious Mexican dish consisting of a corn or flour tortilla filled with various ingredients such as seasoned meat, beans, cheese, and vegetables.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "6 small tortillas",
          "1 lb ground beef or chicken",
          "1 packet of taco seasoning",
          "1 cup shredded lettuce",
          "1 cup diced tomatoes",
          "1/2 cup shredded cheddar cheese",
          "1/4 cup diced onion",
          "1/4 cup chopped cilantro",
          "Salsa, sour cream, and guacamole for topping (optional)"
        ],
        "Instructions": {
          "Markdown": "1. In a skillet, cook the ground beef or chicken over medium heat until fully browned. Drain any excess fat. \n2. Add the taco seasoning and water according to the instructions on the packet. Allow the meat to simmer for a few minutes until the liquid reduces. \n3. Warm the tortillas in a separate skillet or in the microwave. \n4. Assemble the tacos by placing a spoonful of the cooked meat in the center of each tortilla. \n5. Top the meat with shredded lettuce, diced tomatoes, shredded cheese, diced onion, and chopped cilantro. \n6. Serve with salsa, sour cream, and guacamole on the side, if desired. Enjoy your delicious tacos!",
          "Html": null
        }
      },
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Enchiladas",
        "CoverImage": {
          "Url": "enchiladas.webp",
          "AltText": "Enchiladas plated on a colorful dish with avocado slices and a side of salsa and sour cream"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "Enchiladas are a classic Mexican dish featuring tortillas wrapped around a savory filling, covered in a flavorful sauce, and baked to perfection. This recipe is a delicious and satisfying meal for any occasion.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "8 corn tortillas",
          "2 cups cooked shredded chicken",
          "1 cup shredded cheese",
          "1 small onion, finely chopped",
          "2 cloves garlic, minced",
          "1 can (14 oz) red enchilada sauce",
          "1/2 cup chopped fresh cilantro",
          "1 teaspoon ground cumin",
          "1/2 teaspoon chili powder",
          "1 tablespoon olive oil",
          "Salt and pepper to taste",
          "Optional toppings: chopped avocado, sour cream, salsa, sliced jalapeños"
        ],
        "Instructions": {
          "Markdown": "1. Preheat the oven to 350°F (175°C). \n2. In a skillet, heat the olive oil over medium heat. Add the onion and garlic, and sauté until softened. \n3. Add the shredded chicken, cumin, chili powder, salt, and pepper. Cook for a few minutes until the chicken is heated through and well-seasoned. Stir in half of the chopped cilantro. \n4. Warm the enchilada sauce in a separate pot. \n5. Pour a small amount of the enchilada sauce into the bottom of a baking dish and spread it evenly. \n6. One at a time, dip the corn tortillas into the warm enchilada sauce to coat both sides. \n7. Place a portion of the chicken filling in the center of each tortilla, roll it up, and place it seam-side down in the baking dish. Continue until all tortillas are filled and rolled. \n8. Pour the remaining enchilada sauce over the top of the enchiladas, making sure they are evenly coated. \n9. Sprinkle the shredded cheese over the top. \n10. Bake the enchiladas in the preheated oven for 20-25 minutes, or until the cheese is melted and bubbly. \n11. Sprinkle the remaining chopped cilantro over the top. \n12. Serve the enchiladas hot with optional toppings like chopped avocado, sour cream, salsa, and sliced jalapeños. Enjoy!",
          "Html": null
        }
      },
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Guacamole",
        "CoverImage": {
          "Url": "guacamole.webp",
          "AltText": "Guacamole in a traditional serving bowl with tortilla chips on a wooden table"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "Classic guacamole made with ripe avocados, tomatoes, onions, lime juice, and cilantro. Perfect for dipping with tortilla chips or as a topping for tacos and burritos.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "2 ripe avocados",
          "1 small onion, finely chopped",
          "1-2 tomatoes, diced",
          "1-2 cloves of garlic, minced",
          "1-2 jalapeño peppers, seeded and minced (optional)",
          "Juice of 1-2 limes",
          "Salt to taste",
          "Fresh cilantro, chopped",
          "Tortilla chips for serving"
        ],
        "Instructions": {
          "Markdown": "1. Cut the avocados in half, remove the pits, and scoop the flesh into a mixing bowl.\n2. Use a fork to mash the avocados to your desired consistency.\n3. Add the chopped onion, diced tomatoes, minced garlic, and minced jalapeño peppers to the bowl.\n4. Squeeze the lime juice over the mixture and add salt to taste.\n5. Gently fold in the chopped cilantro.\n6. Adjust seasoning as needed.\n7. Serve the guacamole with tortilla chips or as a topping for your favorite Mexican dishes.",
          "Html": null
        }
      },
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Chiles Rellenos",
        "CoverImage": {
          "Url": "chiles-rellenos.webp",
          "AltText": "A plate of Chiles Rellenos with a side of rice and beans"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "Chiles Rellenos are a traditional Mexican dish consisting of roasted poblano peppers stuffed with cheese, coated in egg batter, and fried until golden. They are often served with a flavorful tomato salsa and a side of rice and beans.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "4 large poblano peppers",
          "8 ounces of Oaxaca cheese or Monterey Jack cheese, cut into strips",
          "1 cup of all-purpose flour",
          "4 large eggs, separated",
          "1 cup of vegetable oil for frying",
          "Salt and pepper to taste",
          "For the tomato salsa:",
          "4 ripe tomatoes, chopped",
          "1/2 onion, chopped",
          "2 garlic cloves, minced",
          "1 jalapeño pepper, chopped (seeds removed for less heat)",
          "1/4 cup of cilantro, chopped",
          "Salt and pepper to taste"
        ],
        "Instructions": {
          "Markdown": "1. Begin by roasting the poblano peppers. You can do this over an open flame on a gas stove or under the broiler in the oven. Make sure to turn the peppers occasionally until they are charred all over. Once charred, place the peppers in a plastic bag and let them sweat for about 15 minutes. This will make it easier to peel off the skin.\n2. While the peppers are sweating, prepare the tomato salsa. In a blender or food processor, combine the tomatoes, onion, garlic, jalapeño, cilantro, salt, and pepper. Blend until smooth, then transfer to a serving bowl and set aside.\n3. After the peppers have sweated, remove them from the bag and peel off the charred skin. Make a vertical slit down the side of each pepper and carefully remove the seeds, leaving the stem intact.\n4. Stuff each pepper with the cheese strips, ensuring they are filled but can still be closed with a toothpick.\n5. In a large bowl, beat the egg whites with an electric mixer until stiff peaks form. In a separate bowl, whisk the egg yolks with a pinch of salt. Gently fold the beaten egg whites into the yolks.\n6. Heat the vegetable oil in a large skillet over medium-high heat. Roll each stuffed pepper in flour, shaking off the excess, then dip into the egg batter, coating it evenly.\n7. Fry the coated peppers in the hot oil, turning occasionally, until they are golden brown on all sides. This should take about 4-5 minutes.\n8. Once fried, transfer the Chiles Rellenos to a paper towel-lined plate to drain any excess oil.\n9. Serve the Chiles Rellenos hot, topped with the tomato salsa and alongside rice and beans for a complete meal.",
          "Html": null
        }
      },
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Salsa Verde",
        "CoverImage": {
          "Url": "salsa-verde.webp",
          "AltText": "Salsa verde in a small dish with tortilla chips on a colorful plate"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "Salsa Verde is a delicious and tangy green sauce made with tomatillos, cilantro, onion, and jalapeño. It\u0027s perfect for dipping tortilla chips, topping tacos, or adding flavor to various dishes.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "6 tomatillos, husked and rinsed",
          "1/2 onion, chopped",
          "1-2 jalapeño peppers, stemmed and chopped",
          "1/2 cup fresh cilantro leaves",
          "1 clove garlic, minced",
          "1 tablespoon lime juice",
          "Salt to taste"
        ],
        "Instructions": {
          "Markdown": "1. In a medium saucepan, place the tomatillos and cover with water. Bring to a boil and simmer for about 5-8 minutes, or until the tomatillos are soft and have changed color.\n2. Drain the tomatillos and place them in a blender or food processor.\n3. Add the chopped onion, jalapeño peppers, cilantro, garlic, and lime juice to the blender.\n4. Blend the mixture until smooth. If it\u0027s too thick, you can add a little water.\n5. Season the salsa with salt to taste.\n6. Transfer the salsa verde to a bowl and let it chill in the refrigerator for at least 30 minutes before serving.\n7. Enjoy the salsa with your favorite tortilla chips or use it as a topping for tacos or other dishes.",
          "Html": null
        }
      }
    ]
  },
  {
    "Id": 0,
    "Name": "Italian",
    "Recipes": [
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Spaghetti Carbonara",
        "CoverImage": {
          "Url": "spaghetti-carbonara.webp",
          "AltText": "A plate of spaghetti carbonara with crispy bacon and a sprinkling of parmesan cheese"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "Classic Italian pasta dish featuring spaghetti tossed in a creamy egg and cheese sauce with crispy bacon or pancetta.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "8 oz (225g) spaghetti",
          "4 oz (115g) pancetta or bacon, diced",
          "2 large eggs",
          "1/2 cup (50g) grated Parmesan cheese",
          "Salt and freshly ground black pepper",
          "2 cloves garlic, minced",
          "1/4 cup (60ml) dry white wine (optional)",
          "2 tbsp (30ml) extra virgin olive oil",
          "Fresh parsley, chopped (for garnish)"
        ],
        "Instructions": {
          "Markdown": "1. Cook the spaghetti according to package instructions in a large pot of salted boiling water until al dente. Drain and set aside, reserving some of the pasta water.\n2. In a large skillet, heat the olive oil over medium heat. Add the diced pancetta or bacon and cook until crispy. Add the minced garlic and cook for another minute.\n3. If using white wine, pour it into the skillet and let it simmer for a minute, scraping up any browned bits from the bottom of the pan.\n4. In a mixing bowl, whisk together the eggs, grated Parmesan cheese, and a pinch of black pepper.\n5. Add the cooked spaghetti to the skillet with the pancetta and garlic, tossing to combine. Remove the skillet from the heat and quickly pour in the egg and cheese mixture, tossing the pasta continuously to coat it in the creamy sauce. If needed, add a splash of the reserved pasta water to achieve a silky consistency.\n6. Taste and adjust seasoning with salt and pepper if necessary.\n7. Serve the spaghetti carbonara in individual dishes, garnished with chopped fresh parsley and an additional sprinkle of Parmesan cheese.",
          "Html": null
        }
      },
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Margherita Pizza",
        "CoverImage": {
          "Url": "margherita-pizza.webp",
          "AltText": "A photorealistic image of a beautifully plated Margherita pizza on a wooden pizza peel, fresh basil leaves scattered around, and a drizzle of olive oil on top."
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "Enjoy the classic flavors of Italy with this simple and delicious Margherita pizza. It features a thin crust, flavorful tomato sauce, fresh mozzarella, and fragrant basil.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "1 prepared pizza dough",
          "1/2 cup pizza sauce",
          "8 oz fresh mozzarella, sliced",
          "1-2 tomatoes, sliced",
          "Fresh basil leaves",
          "Olive oil",
          "Salt and pepper to taste"
        ],
        "Instructions": {
          "Markdown": "1. Preheat your oven to the highest setting, typically around 500°F (260°C), and place a pizza stone or upside-down baking sheet inside to heat up.\n2. On a floured surface, roll out the pizza dough into a circle or rectangle to your desired thickness.\n3. Place the rolled-out dough onto a piece of parchment paper for easy transfer to the oven.\n4. Spread the pizza sauce evenly over the dough, leaving a small border around the edges.\n5. Layer the sliced mozzarella evenly over the sauce, followed by the tomato slices.\n6. Carefully transfer the pizza on the parchment paper onto the preheated pizza stone or baking sheet in the oven.\n7. Bake for 10-12 minutes or until the crust is golden and the cheese is bubbly and slightly browned.\n8. Once out of the oven, top the pizza with fresh basil leaves, a drizzle of olive oil, and a sprinkle of salt and pepper to taste.\n9. Slice and serve immediately. Enjoy your delicious Margherita pizza!",
          "Html": null
        }
      },
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Lasagna",
        "CoverImage": {
          "Url": "lasagna.webp",
          "AltText": "A photorealistic image of a plated classic lasagna with melted cheese on top"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "This classic lasagna recipe features layers of hearty meat sauce, creamy cheese filling, and tender lasagna noodles. It\u0027s the ultimate comfort food that\u0027s perfect for sharing with family and friends.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "1 pound ground beef",
          "1 onion, chopped",
          "2 cloves garlic, minced",
          "1 can (28 ounces) crushed tomatoes",
          "2 cans (6 ounces each) tomato paste",
          "1/2 cup water",
          "2 tablespoons white sugar",
          "1 1/2 teaspoons dried basil leaves",
          "1/2 teaspoon fennel seeds",
          "1 teaspoon Italian seasoning",
          "1 tablespoon salt",
          "1/4 teaspoon ground black pepper",
          "4 tablespoons chopped fresh parsley",
          "12 lasagna noodles",
          "16 ounces ricotta cheese",
          "1 egg",
          "3/4 teaspoon salt",
          "3/4 pound mozzarella cheese, sliced",
          "3/4 cup grated Parmesan cheese"
        ],
        "Instructions": {
          "Markdown": "1. In a large skillet over medium heat, cook and stir the ground beef until brown. Add the onion and garlic; continue to cook until the onions are transparent. \n2. Stir in the crushed tomatoes, tomato paste, water, sugar, basil, fennel seeds, Italian seasoning, 1 tablespoon salt, pepper, and 2 tablespoons parsley. Simmer, covered, for about 1 1/2 hours, stirring occasionally. \n3. Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain noodles, and rinse with cold water. \n4. In a mixing bowl, combine ricotta cheese with egg, remaining parsley, and 3/4 teaspoon salt. \n5. Preheat oven to 375 degrees F (190 degrees C). \n6. To assemble, spread 1 1/2 cups of meat sauce in the bottom of a 9x13 inch baking dish. Arrange 6 noodles lengthwise over meat sauce. Spread with one half of the ricotta cheese mixture. Top with a third of mozzarella cheese slices. Spoon 1 1/2 cups meat sauce over mozzarella, and sprinkle with 1/4 cup Parmesan cheese. Repeat layers, and top with remaining mozzarella and Parmesan cheese. \n7. Cover with foil: to prevent sticking, either spray foil with cooking spray, or make sure the foil does not touch the cheese. \n8. Bake in preheated oven for 25 minutes. Remove foil, and bake an additional 25 minutes. Cool for 15 minutes before serving.",
          "Html": null
        }
      },
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Tiramisu",
        "CoverImage": {
          "Url": "tiramisu.webp",
          "AltText": "Tiramisu plated on a dessert plate with cocoa dusted on top"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "Tiramisu is a classic Italian dessert made with layers of coffee-dipped ladyfingers and a rich mascarpone cream, topped with a dusting of cocoa.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "6 egg yolks",
          "3/4 cup granulated sugar",
          "2/3 cup milk",
          "1 1/4 cups heavy cream",
          "1/2 teaspoon vanilla extract",
          "1 pound mascarpone cheese",
          "1 1/2 cups strong brewed coffee, cooled",
          "1/4 cup coffee liqueur (optional)",
          "24 to 30 ladyfinger cookies",
          "2 tablespoons unsweetened cocoa powder, for dusting"
        ],
        "Instructions": {
          "Markdown": "1. In a heatproof bowl, whisk together egg yolks and sugar until well combined. Place the bowl over a pot of simmering water, making sure the bottom of the bowl does not touch the water. Gradually whisk in the milk and cook, stirring constantly, until the mixture thickens and coats the back of a spoon. Remove from heat and let cool completely.\n2. In a separate bowl, whip the heavy cream and vanilla extract until stiff peaks form.\n3. Gently fold the mascarpone cheese into the cooled egg yolk mixture until smooth. Then, fold in the whipped cream until well combined.\n4. In a shallow dish, combine the brewed coffee and coffee liqueur. Dip each ladyfinger into the coffee mixture for a few seconds, making sure not to oversaturate them.\n5. Arrange a layer of dipped ladyfingers in the bottom of a 9x13 inch dish. Spread half of the mascarpone mixture over the ladyfingers. Repeat with another layer of dipped ladyfingers and mascarpone mixture.\n6. Cover and refrigerate the tiramisu for at least 4 hours, or overnight, to set.\n7. Before serving, sift cocoa powder over the top of the tiramisu. Enjoy!",
          "Html": null
        }
      },
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Risotto",
        "CoverImage": {
          "Url": "risotto.webp",
          "AltText": "A plate of creamy mushroom risotto topped with fresh grated parmesan cheese and a sprinkle of chopped parsley"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "This creamy mushroom risotto is a classic Italian dish that\u0027s rich, hearty, and comforting. The combination of tender arborio rice, flavorful mushrooms, and creamy sauce makes it an irresistible option for any meal.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "1 ½ cups Arborio rice",
          "6 cups chicken or vegetable broth",
          "1 cup dry white wine",
          "1 onion, finely chopped",
          "2 cloves garlic, minced",
          "8 oz mushrooms, sliced",
          "1/2 cup grated Parmesan cheese",
          "2 tbsp butter",
          "2 tbsp olive oil",
          "Salt and pepper to taste",
          "Chopped fresh parsley for garnish"
        ],
        "Instructions": {
          "Markdown": "1. In a large saucepan, heat the chicken or vegetable broth over low heat. Keep it warm while you prepare the risotto.\n2. In a separate large, deep skillet, heat the butter and olive oil over medium heat. Add the chopped onion and garlic, and cook until softened.\n3. Add the Arborio rice to the skillet and stir to coat the rice with the butter and oil mixture. Cook for a couple of minutes until the rice becomes translucent around the edges.\n4. Pour in the white wine and let it simmer until it has been absorbed by the rice.\n5. Begin adding the warm broth to the rice mixture, one ladleful at a time, stirring constantly and allowing each addition to be absorbed before adding the next. Continue this process until the rice is tender and the mixture is creamy (this should take around 18-20 minutes).\n6. While the risotto is cooking, sauté the sliced mushrooms in a separate pan until they are golden and tender.\n7. Once the risotto is ready, stir in the sautéed mushrooms and the grated Parmesan cheese. Season with salt and pepper to taste.\n8. Serve the risotto immediately, garnished with a sprinkle of chopped fresh parsley and an extra grating of Parmesan cheese if desired.",
          "Html": null
        }
      }
    ]
  },
  {
    "Id": 0,
    "Name": "Japanese",
    "Recipes": [
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Sushi",
        "CoverImage": {
          "Url": "sushi.webp",
          "AltText": "Sushi roll on a plate with garnishes"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "Sushi is a delicious Japanese dish made from seasoned rice and various fillings, such as seafood, vegetables, and occasionally tropical fruits. It is typically rolled in seaweed and sliced into bite-sized pieces.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "Sushi rice",
          "Nori seaweed sheets",
          "Sashimi-grade fish or seafood (such as salmon, tuna, or shrimp)",
          "Vegetables (such as cucumber, avocado, and carrot)",
          "Rice vinegar",
          "Sugar",
          "Salt",
          "Soy sauce",
          "Pickled ginger",
          "Wasabi"
        ],
        "Instructions": {
          "Markdown": "1. Prepare the sushi rice according to the package instructions, then season with a mixture of rice vinegar, sugar, and salt. Let it cool to room temperature.\n2. Lay a sheet of nori on a bamboo sushi mat, then evenly spread a thin layer of sushi rice over the nori, leaving a small margin at the top of the sheet.\n3. Arrange your choice of fillings (fish, seafood, and vegetables) across the center of the rice.\n4. Using the bamboo mat, roll the sushi into a tight cylinder, applying gentle pressure as you roll to ensure a compact shape.\n5. Slice the sushi roll into bite-sized pieces using a sharp knife dipped in water to prevent sticking.\n6. Serve the sushi with pickled ginger, wasabi, and soy sauce for dipping. Enjoy your homemade sushi!",
          "Html": null
        }
      },
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Yakitori",
        "CoverImage": {
          "Url": "yakitori.webp",
          "AltText": "Yakitori skewers on a traditional Japanese plate with garnishes"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "Yakitori is a popular Japanese dish consisting of bite-sized pieces of chicken grilled on skewers. The chicken is traditionally seasoned with a sweet and savory sauce, resulting in a delicious, smoky flavor.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "1 lb boneless, skinless chicken thighs, cut into bite-sized pieces",
          "1/2 cup soy sauce",
          "1/2 cup mirin",
          "1/4 cup sake",
          "2 tbsp sugar",
          "Bamboo skewers, soaked in water"
        ],
        "Instructions": {
          "Markdown": "1. In a small saucepan, combine the soy sauce, mirin, sake, and sugar. Heat over medium heat until the sugar is dissolved. Allow the sauce to cool.\n2. Thread the chicken pieces onto the soaked bamboo skewers.\n3. Preheat a grill or broiler to medium-high heat. If using a grill, oil the grates to prevent sticking.\n4. Place the chicken skewers on the grill or under the broiler. Cook for 3-4 minutes on each side, basting with the prepared sauce, until the chicken is cooked through and nicely charred.\n5. Serve the yakitori hot, sprinkled with sesame seeds and chopped green onions, if desired. Enjoy!",
          "Html": null
        }
      },
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Miso Soup",
        "CoverImage": {
          "Url": "miso-soup.webp",
          "AltText": "Miso soup served in a traditional Japanese bowl with a garnish of green onions and tofu"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "A warm and comforting Japanese soup with a savory umami flavor from miso paste, combined with delicate tofu and fresh green onions.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "4 cups dashi (Japanese soup stock)",
          "3 tbsp miso paste",
          "1/2 block tofu, cubed",
          "2 green onions, thinly sliced",
          "2 tbsp wakame seaweed (optional)",
          "1 tbsp soy sauce (optional)"
        ],
        "Instructions": {
          "Markdown": "1. In a pot, bring the dashi to a simmer over medium heat. If using wakame seaweed, add it to the pot and let it rehydrate for a few minutes.\n2. In a small bowl, dilute the miso paste with a small amount of the hot dashi to create a smooth miso mixture.\n3. Add the diluted miso paste to the pot and stir until fully incorporated.\n4. Add the cubed tofu to the pot and let it simmer for a few minutes.\n5. Taste the soup and add soy sauce if desired for extra flavor.\n6. Ladle the miso soup into serving bowls and sprinkle green onions on top.\n7. Serve hot and enjoy your comforting Miso Soup!",
          "Html": null
        }
      },
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Tonkatsu",
        "CoverImage": {
          "Url": "tonkatsu.webp",
          "AltText": "Tonkatsu plated on a white plate with a side of shredded cabbage and a slice of lemon"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "Tonkatsu is a popular Japanese dish consisting of a breaded and deep-fried pork cutlet. It is typically served with shredded cabbage, a side of tonkatsu sauce, and steamed rice.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "4 pork loin or pork tenderloin cutlets, about 1/2 inch thick",
          "Salt and pepper",
          "1/2 cup all-purpose flour",
          "2 large eggs, beaten",
          "1 cup panko breadcrumbs",
          "Vegetable oil for frying",
          "Shredded cabbage for serving",
          "Tonkatsu sauce for serving",
          "Lemon slices for serving"
        ],
        "Instructions": {
          "Markdown": "1. Season the pork cutlets with salt and pepper on both sides.\n2. Dredge each cutlet in flour, shaking off any excess.\n3. Dip the cutlets into the beaten eggs, allowing any excess to drip off.\n4. Coat the cutlets with panko breadcrumbs, pressing gently to adhere.\n5. Heat vegetable oil in a large frying pan over medium heat.\n6. Fry the breaded cutlets for about 5 minutes on each side, or until golden brown and cooked through.\n7. Remove the cutlets from the pan and drain on paper towels.\n8. Serve the tonkatsu with shredded cabbage, tonkatsu sauce, and lemon slices on the side.",
          "Html": null
        }
      },
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Gyoza",
        "CoverImage": {
          "Url": "gyoza.webp",
          "AltText": "Gyoza dumplings arranged on a plate with dipping sauce and garnish"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "Gyoza are delicious Japanese dumplings filled with a juicy and savory mixture of ground meat and vegetables, wrapped in a thin dough and then pan-fried to crispy perfection. They are a popular appetizer or snack in Japan and around the world.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "Gyoza wrappers",
          "Ground pork or chicken",
          "Cabbage",
          "Green onions",
          "Garlic",
          "Ginger",
          "Soy sauce",
          "Sesame oil",
          "Salt",
          "Pepper",
          "Vegetable oil",
          "Dipping sauce (soy sauce, rice vinegar, and chili oil)"
        ],
        "Instructions": {
          "Markdown": "1. Finely chop the cabbage, green onions, garlic, and ginger. Mix them with the ground meat in a large bowl. Add soy sauce, sesame oil, salt, and pepper to the mixture and combine well.\n2. Take a gyoza wrapper and place a small spoonful of the filling mixture in the center. Moisten the edges of the wrapper with water, then fold and pleat the wrapper to seal the filling inside. Repeat this process until all the filling is used.\n3. Heat a non-stick pan over medium-high heat and add vegetable oil. Once the oil is hot, place the gyoza in the pan in a single layer, flat side down. Cook until the bottom of the gyoza becomes golden brown.\n4. Carefully pour water into the pan, quickly cover with a lid, and steam the gyoza for a few minutes until the wrappers are translucent and the filling is cooked through.\n5. Uncover the pan and let the gyoza fry for an additional minute, until the bottoms are crispy again.\n6. Remove the gyoza from the pan and serve them with the dipping sauce. Enjoy your delicious homemade gyoza!",
          "Html": null
        }
      }
    ]
  },
  {
    "Id": 0,
    "Name": "Indian",
    "Recipes": [
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Chicken Tikka Masala",
        "CoverImage": {
          "Url": "chicken-tikka-masala.webp",
          "AltText": "A plated serving of chicken tikka masala with naan bread and rice on a colorful table setting"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "A classic and flavorful Indian dish featuring marinated and grilled chicken pieces simmered in a rich, creamy tomato sauce.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "For the chicken tikka:",
          "- 2 lbs boneless, skinless chicken thighs, cut into bite-sized pieces",
          "- 1 cup plain yogurt",
          "- 3 cloves garlic, minced",
          "- 1 tbsp ginger, minced",
          "- 2 tbsp lemon juice",
          "- 2 tsp ground cumin",
          "- 2 tsp ground coriander",
          "- 1 tsp paprika",
          "- 1 tsp turmeric",
          "- 1/2 tsp cayenne pepper",
          "- Salt to taste",
          "For the masala sauce:",
          "- 2 tbsp ghee or oil",
          "- 1 large onion, finely chopped",
          "- 4 cloves garlic, minced",
          "- 1 tbsp ginger, minced",
          "- 1 1/2 tbsp garam masala",
          "- 1 1/2 tbsp ground coriander",
          "- 1 1/2 tbsp ground cumin",
          "- 1/2 tsp turmeric",
          "- 1/2 tsp cayenne pepper",
          "- 1 can (14 oz) crushed tomatoes",
          "- 1 cup heavy cream",
          "- Salt and pepper to taste",
          "- Fresh cilantro, for garnish"
        ],
        "Instructions": {
          "Markdown": "1. In a large bowl, combine the yogurt, garlic, ginger, lemon juice, cumin, coriander, paprika, turmeric, cayenne, and salt. Add the chicken pieces, coating them well with the marinade. Cover and refrigerate for at least 1 hour, or overnight for best results.\n2. Preheat the grill to medium-high heat. Thread the marinated chicken pieces onto skewers and grill until cooked through and nicely charred, about 10-12 minutes.\n3. In a large, deep skillet or pot, heat ghee or oil over medium heat. Add the chopped onion and cook until softened and lightly browned, about 5-6 minutes. Add the garlic and ginger, and cook for another 2 minutes.\n4. Stir in the garam masala, coriander, cumin, turmeric, and cayenne pepper. Cook for 1-2 minutes, stirring constantly to toast the spices.\n5. Pour in the crushed tomatoes and bring the mixture to a simmer. Let it cook for about 10 minutes, stirring occasionally.\n6. Stir in the heavy cream and season the sauce with salt and pepper to taste. Add the grilled chicken tikka pieces to the sauce and simmer for an additional 10 minutes.\n7. Serve the chicken tikka masala over steamed rice, garnished with fresh cilantro. Enjoy with naan bread or your favorite Indian bread.",
          "Html": null
        }
      },
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Palak Paneer",
        "CoverImage": {
          "Url": "palak-paneer.webp",
          "AltText": "A plate of Palak Paneer with garnished coriander and a side of naan bread"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "Palak Paneer is a popular North Indian dish made of spinach and paneer (Indian cottage cheese) cooked with aromatic spices. It is a creamy and flavorful vegetarian dish that pairs well with naan or rice.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "2 cups fresh spinach leaves, washed and chopped",
          "200g paneer, cut into cubes",
          "1 onion, finely chopped",
          "2 tomatoes, pureed",
          "2 garlic cloves, minced",
          "1-inch piece of ginger, grated",
          "1 green chili, chopped",
          "1 teaspoon cumin seeds",
          "1 teaspoon garam masala",
          "1 teaspoon coriander powder",
          "1/2 teaspoon turmeric powder",
          "1/2 cup heavy cream",
          "2 tablespoons ghee or oil",
          "Salt to taste"
        ],
        "Instructions": {
          "Markdown": "1. Blanch the chopped spinach leaves in boiling water for 2-3 minutes and then transfer to a bowl of ice water. Drain and blend the spinach to a smooth puree.\n2. Heat ghee or oil in a pan and add cumin seeds. Once they splutter, add chopped onions, minced garlic, grated ginger, and green chili. Saute until the onions turn golden brown.\n3. Add the tomato puree and cook until the oil starts to separate from the masala.\n4. Stir in the garam masala, coriander powder, turmeric powder, and salt. Cook for a few minutes.\n5. Add the spinach puree and cook for 5-7 minutes.\n6. Add the paneer cubes and mix gently. Simmer for 2-3 minutes.\n7. Pour in the heavy cream and simmer for an additional 2-3 minutes.\n8. Palak Paneer is ready to be served with naan or rice. Garnish with a swirl of cream and a sprinkle of garam masala if desired.",
          "Html": null
        }
      },
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Butter Chicken",
        "CoverImage": {
          "Url": "butter-chicken.webp",
          "AltText": "Butter Chicken served on a white plate with naan bread and garnished with fresh cilantro and a dollop of yogurt"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "Butter Chicken is a classic Indian dish featuring tender chicken in a rich and creamy tomato sauce. It\u0027s a flavorful and satisfying dish that\u0027s perfect served with naan or rice.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "1.5 lbs boneless, skinless chicken thighs\n2 tbsp lemon juice\n1 cup plain yogurt\n2 tbsp garam masala\n1 tbsp ground cumin\n1 tbsp ground turmeric\n1 tbsp ground coriander\n2 tsp chili powder\n2 tbsp grated fresh ginger\n4 cloves garlic, minced\n1 cup tomato puree\n1 cup heavy cream\n4 tbsp butter\n2 tbsp vegetable oil\n1 large onion, finely chopped\nSalt to taste\nFresh cilantro for garnish"
        ],
        "Instructions": {
          "Markdown": "1. Cut the chicken thighs into bite-sized pieces and place in a bowl. Add the lemon juice and 1/2 cup of yogurt. Mix well, cover, and refrigerate for at least 1 hour.\n2. In another bowl, combine the garam masala, cumin, turmeric, coriander, chili powder, ginger, and garlic. Add the marinated chicken to the bowl and coat it well with the spice mixture. Cover and marinate for at least 30 minutes.\n3. Preheat the oven to 400°F (200°C). Thread the chicken pieces onto skewers and place on a baking sheet. Bake for 10-15 minutes or until the chicken is cooked through. Remove from the oven and set aside.\n4. In a large pan, heat the vegetable oil over medium heat. Add the chopped onion and sauté until soft and translucent.\n5. Add the tomato puree to the pan and cook for 2-3 minutes. Stir in the remaining yogurt and heavy cream. Simmer for 5 minutes.\n6. Add the baked chicken pieces to the pan and simmer for an additional 10-15 minutes, stirring occasionally.\n7. Stir in the butter and season with salt to taste.\n8. Garnish with fresh cilantro and serve with naan bread or rice. Enjoy!",
          "Html": null
        }
      },
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Aloo Gobi",
        "CoverImage": {
          "Url": "aloo-gobi.webp",
          "AltText": "Aloo Gobi plated on a serving dish with fresh cilantro garnish"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "Aloo Gobi is a classic Indian dish made with potatoes (aloo) and cauliflower (gobi) cooked with aromatic spices. It\u0027s a comforting and flavorful vegetarian dish that pairs well with rice or roti.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "2 large potatoes, peeled and cubed",
          "1 small cauliflower, cut into florets",
          "1 onion, finely chopped",
          "2 tomatoes, finely chopped",
          "3-4 garlic cloves, minced",
          "1-inch piece of ginger, grated",
          "1 tsp cumin seeds",
          "1 tsp turmeric",
          "1 tsp ground coriander",
          "1 tsp garam masala",
          "1/2 tsp red chili powder",
          "Salt to taste",
          "2 tbsp oil",
          "Fresh cilantro for garnish"
        ],
        "Instructions": {
          "Markdown": "1. Heat oil in a large pan over medium heat. Add cumin seeds and let them sizzle for a few seconds.\n2. Add the chopped onions and sauté until they turn golden brown.\n3. Stir in the minced garlic and grated ginger, and cook for another minute.\n4. Add the chopped tomatoes and cook until they soften and the oil begins to separate.\n5. Add turmeric, ground coriander, garam masala, red chili powder, and salt. Stir well.\n6. Add the cubed potatoes and cauliflower florets to the pan. Mix until the vegetables are coated with the spices.\n7. Cover the pan and cook for 15-20 minutes, stirring occasionally, until the potatoes and cauliflower are tender.\n8. Once the vegetables are cooked, garnish with fresh cilantro and serve hot with rice or roti.",
          "Html": null
        }
      },
      {
        "Id": 0,
        "OwnerId": null,
        "Owner": null,
        "Name": "Chana Masala",
        "CoverImage": {
          "Url": "chana-masala.webp",
          "AltText": "Chana Masala plated on a colorful ceramic plate with fresh cilantro garnish"
        },
        "CuisineId": 0,
        "Cuisine": null,
        "Description": "Chana Masala is a popular Indian dish made with chickpeas cooked in a flavorful and aromatic tomato-based sauce. It\u0027s a comforting and hearty vegetarian meal that is best served with rice or naan.",
        "Created": "0001-01-01T00:00:00",
        "Modified": null,
        "Ingredients": [
          "2 cups cooked chickpeas",
          "2 tablespoons oil",
          "1 onion, finely chopped",
          "3 garlic cloves, minced",
          "1-inch piece of ginger, grated",
          "2 green chilies, finely chopped",
          "1 teaspoon cumin seeds",
          "1 teaspoon coriander powder",
          "1 teaspoon cumin powder",
          "1/2 teaspoon turmeric powder",
          "1 teaspoon garam masala",
          "1 teaspoon paprika",
          "2 cups chopped tomatoes",
          "1 tablespoon tomato paste",
          "1 cup water",
          "Salt to taste",
          "Fresh cilantro for garnish"
        ],
        "Instructions": {
          "Markdown": "1. Heat oil in a large pan over medium heat. Add the cumin seeds and cook until they sizzle and become fragrant. \n2. Add the chopped onions, garlic, ginger, and green chilies. Saute until the onions are soft and translucent. \n3. Stir in the coriander powder, cumin powder, turmeric powder, garam masala, and paprika. Cook for a minute to toast the spices. \n4. Add the chopped tomatoes and tomato paste. Cook until the tomatoes break down and the mixture thickens. \n5. Add the cooked chickpeas and water. Season with salt. \n6. Simmer the chana masala for 15-20 minutes, stirring occasionally, until the flavors are well combined and the sauce has thickened. \n7. Garnish with fresh cilantro and serve hot with rice or naan.",
          "Html": null
        }
      }
    ]
  }
]